<img src="../images/logos.png" align="center">
<br>
<h1 align=center><font size = 5>Statistiques : Noms des enfants US de 2004 à 2014</font></h1>

### 1. Import des librairies

In [1]:
import pandas as pd
import numpy as np

### 2. Télécharger le jeu de données depuis babyNames.csv depuis le drive


### 3. Stocker les données dans un dataframe *baby_names*.

In [2]:
baby_names = pd.read_csv('babyNames.csv')

### 4. Afficher les 10 premières lignes

In [3]:
baby_names.head(10)

   Unnamed: 0  Unnamed: 0.1     Id      Name  Year Gender State  Count
0           0         11349  11350      Emma  2004      F    AK     62
1           1         11350  11351   Madison  2004      F    AK     48
2           2         11351  11352    Hannah  2004      F    AK     46
3           3         11352  11353     Grace  2004      F    AK     44
4           4         11353  11354     Emily  2004      F    AK     41
5           5         11354  11355   Abigail  2004      F    AK     37
6           6         11355  11356    Olivia  2004      F    AK     33
7           7         11356  11357  Isabella  2004      F    AK     30
8           8         11357  11358    Alyssa  2004      F    AK     29
9           9         11358  11359    Sophia  2004      F    AK     28

### 5. Supprimer les colonnes 'Unnamed: ...' et 'Id'

In [4]:
baby_names.columns
baby_names.drop(['Unnamed: 0', 'Unnamed: 0.1', 'Id'], axis=1 , inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### 6. Y a t-il une majorité de noms masculins ou feminins dans ce jeu de données ?

In [13]:
baby_names.Gender.value_counts(normalize=True)*100

F    54.983151
M    45.016849
Name: Gender, dtype: float64

### 7. Combien de noms différents y a t-il dans ce jeu de données ?

In [15]:
baby_names.Name.value_counts().count()

17632

### 8. Quel est le nom le plus fréquent ?

In [20]:
#del baby_names["Year"]
#group  the data
noms = baby_names.groupby("Name").sum()

noms.Count.idxmax()

'Jacob'

### 9. Combien de noms différents ont la plus basse occurence ?

In [21]:
len(noms[noms.Count==noms.Count.min()])

2578

### 10. Quelle est l'occurence médiane ?

In [22]:
noms[noms.Count== noms.Count.median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### 11. Quel est l'écart-type des occurences de noms ?

In [23]:
noms.Count.std()

11006.069467891111

### 12. Afficher un résumé statistiques : moyenne, min, max, ecart-type et quartiles, sur laes occurences de noms

In [24]:
noms.Count.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64

<hr>
Copyright &copy; 2020 Hatem & Driss @NEEDEMAND